package car;
/*
 * Car(자동차) 라는 타입의 실제 객체를 생성하고 
 * 사용하는 클래스
 * 
 * 
 */
public class CarTest {

	public static void main(String[] args) {
		// Car 라는 타입의 객체를 사용하기위한
		// 참조 변수가 필요함.
		// - 입술의 말- C5
		// 아무 일 없듯이 굳게 잠긴 말들
		// 돌아서는 뒷모습에 들리지 않는 인사를
		// 시간이 지나가도 덜어내진 못할
		// 네 입술의 못된 말이 전부 다 너의 맘일까
		// 안녕 그대로 걸어가 우리 이제 다시 만나지 말아
		// 잊혀짐도 잊을만큼 나를 지워가 돌아선 그대로
		// 남아있는 나의 맘은 하루하루 모두 흩어짐으로
		// 결국에는 사랑만을 내게 말했던 네 고운 입술만
		// 시간이 지나가도 덜어내진 못할
		// 네 입술의 못된 말이 전부 다 너의 맘일까
		// 살아가는 동안에 이런 사랑 다시 온대도
		// 그 처음이 너였음을 잊지 않을께
		// 이루어질 수 없었던 우리 둘의 얘기는 여기까지인 거야
		// 안녕 그대로 걸어가 우리 이제 다시 만나지 말아
		// 잊혀짐도 잊을만큼 나를 지워가 돌아선 그대로
		// 남아있는 나의 맘은 하루하루 모두 흩어짐으로
		// 결국에는 사랑만을 내게 말했던 네 고운 입술만
		// 네 고운 입술만
		
		// - One Love - C#5
		// 이젠 내가 돌아서려 해 다신 그 사람과 네 앞에서 보이지 않게
		// 이젠 너에겐 어떤 바램도 작은 기대조차 할 수 없는 나잖아
		// 하지만 시간이 많이 지난 후에도 나의 숨결 나의 향기 네게 묻어있다면
		// 언제나 힘들던 이룰 수 없던 사랑 너에게도 너무 큰 아픔이었다면
		// 다시 내게 돌아와 너를 떠나 보내고 후회하고 있는 내게
		// 함께할 수 없음이 나에겐 너무도 커다란 아픔인 걸 아니
		// 언제나 힘들던 이룰 수 없던 사랑 너에게도 너무 큰 아픔이었다면 돌아와 줘
		// 후회없는 사랑하기 위해 내가 택한 사람은 너 뿐야
		// 언젠가 내게 돌아와 줄 너잖아
		// 힘든 시간 다 지나도 오랜 간절함에 되찾은 내 마지막 사랑인 걸
		// 다시 내게 돌아와 너를 떠나 보내고 후회하고 있는 내게
		// 함께할 수 없음이 나에겐 너무도 커다란 아픔인 걸 아니
		
		// - 희망 - C5
		// 범이 와 버린 거리엔 깨진 꿈의 조각으로
		// 부서진 나의 꿈을 다시 그리지 가득히 가득히 그리며
		// 그대와 그대의 마음이 꿈과 함께 담은 채로
		// 다시 걸어가지 새벽을 향해서 그렇게 돌고 도는 거잖아
		// 나의 날개로 너를 감싸주겠어 나의 끝날까지 함께 걷도록
		// 그 곳에 닿는 날까지 절망을 위하여 희망을 위해
		// 그대와 그대의 마음이 꿈과 함께 담은 채로
		// 다시 걸어가지 새벽을 향해서 그렇게 돌고 도는 거잖아
		// 나의 날개로 너를 감싸 주겠어 나의 끝날까지 함께 걷도록
		// 그 곳에 닿는 날까지 절망을 위하여 희망을 위해
		// 이제 알아 나의 마음이 나의 것이 아님을
		// 이미 나는 나의 마음을 막을 수 없단 걸
		// 날개로 너를 감싸 주겠어 나의 끝날까지 함께 걷도록
		// 그 곳에 닿는 날까지 절망을 위하여 희망을 위해
		// 그 곳에 닿는 날까지 절망을 위하여 희망을 위해
		
		// - 아버지 - F5
		// 따스한 봄날 함께한 순간 너무나도 그리워
		// 잘 될 거라고 할 수 있다고 날 믿어준 사람
		// 보고 싶어서 꼭 보고 싶어서 기억 속을 헤매요 만날 수 없지만
		// 아름다웠던 지난 시간은 이제 추억이 되고
		// 당신을 보며 꿈을 키웠던 시절이 그리워
		// 당신을 닮은 남자로 커져가는 나 이젠 함께할 약속 지킬꺼예요
		// 당신이 보여준 그 마음 안고서 무대에 올라요 날 바라보세요
		// 이 세상 누구보다 소중한 사람 당신께 불러드릴 나의 이 노래
		// 간절히 원했던 지금 이 순간 당신을 위해서 노래를 불러요
		// 이 세상 누구보다 소중한 사람 그 곳에서라도 날 지켜 주세요
		// 당신이 보여준 그 마음 안고서 무대에 올라요 날 바라보세요
		// 이 세상 누구보다 소중한 사람 당신께 불러드릴 나의 이 노래
		// 날 바라보세요
		
		// - 연극 - 
		// 들어와야죠 문을 닫아요 발 끝만 보며 망설이는 그대
		// 반쯤 닫힌 문을 잡고 하려하는 그 말 난 견디기 힘들꺼예요
		// 사랑은 연약한 저 꽃나무처럼 저 혼자 자랄 수 없단 걸 알아서
		// 그래서 조심했었죠 소중히 다뤘죠 이렇게 시들 줄 난 모르고
		// 속으로 펑펑 울며 그댈 보내고 있죠 겉으론 못 이기는 척 사랑을 끝내죠
		// 그대가 미안해 할까봐 연극을 하죠 첨부터 나쁜남자였던 것처럼
		// 잠든 모습이 천사 같았죠 꿈 속에서도 그대를 꿈꿨죠
		// 그래서 날아갔는지 다 흩어졌는지 잡을 수 없는 허상인 거죠
		// 속으로 펑펑 울며 그댈 보내고 있죠 겉으론 못 이기는 척 사랑을 끝내죠
		// 그대가 미안해 할까 봐 연극을 하죠 첨부터 나쁜남자였던 것처럼
		// 울고 또 울고 펑펑 울고 다시 또 울죠 머리론 이길 수 없는 가슴을 어떡해
		// 삼키고 참고 숨겨봐도 어쩔 수 없죠 그 사람이 아직 내 것 같아서
		// 누군가 사랑을 묻거든 그대 얘길 들려줄께요
		
		// - My Angel - G5
		/* 아무렇지 않은 듯 떠난 너 보고싶을 때면 하늘늘 봐
		 * 미소지며 손짓을 하던 너는 내 기억속에 사라져 가고 있어
		 * 그럴 땐 너무나 슬퍼져 두 눈을 감게 되지
		 * 너의 손끝이라도 포근히 느껴 봤으면 이 세상 누구보다 행복할 텐데
		 * 희미해진 너의 기억을 나에게 돌이켜 줘 이 세상 홀로 남은 날 위해
		 * 그렇게 떠나간 나의 사랑아 나를 용서해 줘 
		 * 흔적없이 사라진 나의 사랑아 너무 보고싶어
		 * 다시는 볼 수 없는 My love angel 나를 용서해 줘
		 * 기억속에 사라진 My love angel 너무 보고싶어
		 * I want to see you my love angel Forever love
		 * 영원할 수 있는 그 곳까지 너와 함께
		 */
		
		/* 
		 * 
		 */
		
		// 1. Car 타입 변수의 선언
		Car myCar;
		
		// 2. 초기화
		myCar = new Car(); //생성자를 생성했기 때문에 ()안에 아무것도 넣지 않는다.
		
		
		// 3. 사용 : Car 라는 타입(클래스)에 정의된 메소드 호출
		System.out.println("1. myCar의 초기화 후 속도");
		myCar.print();
		
		System.out.println("2. 60만큼 가속 후 속도");
		myCar.accelerate(60);
		myCar.print();
		
		System.out.println("3. 20만큼 추가 가속 후 속도");
		myCar.accelerate(20);
		myCar.print();
		
		System.out.println("4. 정지 후 속도");
		myCar.stop();
		myCar.print();

	}

}
